app/controllers/school_classes_controller.rb

 def create
@class = SchoolClass.new(school_class_params(:title, :room_number))
@class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Math 101"], ["room_number", "303"], ["created_at", "2020-10-29 00:57:04.012229"], ["updated_at", "2020-10-29 00:57:04.012229"]]